In [1]:
# In this long introduction, we willimport numpy (as np) and pandas (as pd), and work extensively with different
# kinds of data array (structures).
import pandas as pd

In [2]:
obj3 = pd.Series(["blue","purple","yellow"], index = [0,2,4])

In [3]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [4]:
obj3.reindex(range(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
import numpy as np

In [6]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index = ["a","c","d"],
                    columns = ["Ohio", "Texas", "California"] )

In [7]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [8]:
frame2 = frame.reindex(["a","b","c","d"])

In [9]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [10]:
states = ["New York","New Hampshire","New Jersey"]

In [11]:
frame2.reindex(columns=states)

   New York  New Hampshire  New Jersey
a       NaN            NaN         NaN
b       NaN            NaN         NaN
c       NaN            NaN         NaN
d       NaN            NaN         NaN

In [12]:
frame.reindex(columns=states)

   New York  New Hampshire  New Jersey
a       NaN            NaN         NaN
c       NaN            NaN         NaN
d       NaN            NaN         NaN

In [13]:
obj = pd.Series(np.arange(5.), index=["a","b","c","d","e"])

In [14]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [15]:
new_obj = obj.drop("c")

In [16]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
obj.drop(["d","b"])

a    0.0
c    2.0
e    4.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ["Ohio","Colorado","Utah","New York"],
                   columns = ["One","Two","Three","Four"])

In [19]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data.drop("Two",axis=1)

          One  Three  Four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [21]:
data.drop(["One","Three"], axis="columns")

          Two  Four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [22]:
obj.drop("c",inplace=True)

In [23]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [24]:
# inplace destroys any data that is dropped by this operation.

In [25]:
# let us create a dataset so that we can subset/loc/iloc data

In [26]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ["Ohio", "New York", "New Jersey", "Massachusetts"],
                   columns = ["one","two","three","four"])

In [27]:
data

               one  two  three  four
Ohio             0    1      2     3
New York         4    5      6     7
New Jersey       8    9     10    11
Massachusetts   12   13     14    15

In [28]:
data["two"]

Ohio              1
New York          5
New Jersey        9
Massachusetts    13
Name: two, dtype: int64

In [29]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
New York    4    5      6     7

In [30]:
data[["three","two"]]

               three  two
Ohio               2    1
New York           6    5
New Jersey        10    9
Massachusetts     14   13

In [31]:
data[data["three"] > 5]

               one  two  three  four
New York         4    5      6     7
New Jersey       8    9     10    11
Massachusetts   12   13     14    15